app/views/gossips/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
<%# VERIFIE SI IL Y A UNE SESSION %>
<% if User.find_by(id: session[:user_id]) %>
 <h2><%= User.find_by(id: session[:user_id]).first_name %> !</h2>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  <div class="card-body">
    <h5 class="card-title"><b>Auteur du gossip: </b><%= i.user.first_name %></h5>