app/views/gossips/show.html.erb

<p><h1>Gossip de <%= @gossip.user.first_name %> <%=@gossip.user.last_name %></h1> A posté depuis <a href="../cities/<%=@gossip.user.city.id %>"> <%= @gossip.user.city.name%> </a></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

<p><a href="../users/<%=@gossip.user.id %>">Voir le profil de <%= @gossip.user.first_name %></a> </p>
<% unless session[:user_id] == Gossip.find(params[:id]).user %>
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]