app/controllers/cities_controller.rb

  def show
    puts "/"*60
    puts params
    puts "/"*60
    c = City.all
    position = params[:id].to_i
    @city = c[position-1]

    user_array = @city.users
    @gossips_array = []

    user_array.each do |u|
---
SELECT "cities".* FROM "cities"
SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 2]]