app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    puts "$" * 60
    puts "Voici le message de l'URL :"
    puts  params[:first_name]
    puts "$" * 60
    @first_name = params[:first_name]
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    puts "$" * 60
    puts params[:id]
    puts "$" * 60
    @gossip = Gossip.find(params[:id])

INSERT INTO "users" ("city_id", "first_name", "last_name", "description", "email", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "cities".* FROM "cities"
INSERT INTO "gossips" ("user_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 18], ["title", "aaaaaa"], ["content", "fffssfsfsdfsfsdf"], ["created_at", "2019-02-08 01:01:55.320057"], ["updated_at", "2019-02-08 01:01:55.320057"]]
---
  def create
    @anonymous = User.create!(city_id: City.all.sample.id, first_name: Faker::Name.first_name, last_name: Faker::Name.last_name, description: Faker::TvShows::SiliconValley.quote, email: Faker::Internet.email, age: Faker::Number.between(1, 100))
    puts @anonymous.id
    puts title:params[:title]
    @gossip = Gossip.new(user_id: @anonymous.id, city_id: @anonymous.city_id, title:params[:title], content:params[:content])
    if @gossip.save