app/controllers/sessions_controller.rb

  def create
    puts "*"*60
    puts params
    puts "*"*60
    #verifie si l email du formulaire existe dans la bae de données
    if User.find_by(email:params[:email])
      my_user = User.find_by(email:params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "william@spartacus.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "cynthia@yacinth.com"], ["LIMIT", 1]]