app/controllers/users_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "Tashamouth"], ["LIMIT", 1]]
INSERT INTO "users" ("city_id", "first_name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    "@"*60
    puts params
      "@"*60


    if params[:password] == params[:password_confirmation]
      my_city = City.find_by(name:params[:name])

      u = User.new(city_id:my_city.id, first_name:params[:first_name], last_name:params[:last_name], email:params[:email],password:params[:password])
      puts "*"*60
      puts u.password_digest
      puts "*"*60
      u.save

SELECT "cities".* FROM "cities"
---
  def new
    @city = City.all

SELECT "users".* FROM "users"
---
  def show
    @city = City.all
    id_params = params[:id].to_i
    @array_user = User.all