app/views/cities/show.html.erb

Les potins de la ville :
<% @city.gossips.each do |i| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."city_id" = $1  [["city_id", 1]]

  <div class="card-body">
    <h5 class="card-title"><b>Auteur du gossip: </b><%= i.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]