app/views/layouts/application.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
        <li><%= link_to "Sign up", new_user_path %>></li>
      <% if User.find_by(id: session[:user_id]) %>